-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-07-14 05:46:03
-- 伺服器版本： 10.4.18-MariaDB
-- PHP 版本： 7.3.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `campfun`
--

-- --------------------------------------------------------

--
-- 資料表結構 `productcategory`
--

CREATE TABLE `productcategory` (
  `id` int(11) NOT NULL,
  `cat_id` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `cat_name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '修改時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `productcategory`
--

INSERT INTO `productcategory` (`id`, `cat_id`, `cat_name`, `created_at`, `updated_at`) VALUES
(18, 'A', '帳篷/天幕', '2021-05-12 08:29:47', '2021-07-10 15:33:46'),
(20, 'B', '桌椅/戶外家具', '2021-05-12 08:30:06', '2021-07-10 15:34:44'),
(21, 'C', '寢具/睡袋', '2021-05-12 08:34:38', '2021-07-10 15:40:00'),
(22, 'D', '火盆/炊具', '2021-05-12 08:34:45', '2021-07-10 15:40:00'),
(23, 'E', '餐廚具', '2021-05-13 01:27:41', '2021-07-10 15:40:00'),
(24, 'F', '燈具/飾品', '2021-05-13 01:27:50', '2021-07-10 15:40:00'),
(25, 'G', '其他類', '2021-05-13 01:27:57', '2021-07-10 15:40:00');

-- --------------------------------------------------------

--
-- 資料表結構 `productlist`
--

CREATE TABLE `productlist` (
  `cat_id` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品分類編號',
  `product_id` int(5) UNSIGNED ZEROFILL NOT NULL COMMENT '商品編號',
  `product_name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品名稱',
  `product_summary` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品短述',
  `product_desc` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品長述',
  `product_img` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品主圖(預留)',
  `product_oimg` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_cimg` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '卡片用圖片',
  `product_ocimg` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '卡片用線上圖片',
  `tag_id` int(11) NOT NULL COMMENT '主TAG',
  `product_price` int(11) NOT NULL COMMENT '價格',
  `product_rate` int(11) NOT NULL COMMENT '評分',
  `qty` int(11) NOT NULL COMMENT '臨時性DEMO數量',
  `state` int(11) NOT NULL COMMENT '物品狀態',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '建立日期',
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新日期'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商品清單';

--
-- 傾印資料表的資料 `productlist`
--

INSERT INTO `productlist` (`cat_id`, `product_id`, `product_name`, `product_summary`, `product_desc`, `product_img`, `product_oimg`, `product_cimg`, `product_ocimg`, `tag_id`, `product_price`, `product_rate`, `qty`, `state`, `created_at`, `updated_at`) VALUES
('A', 00001, 'Minute Dome Pro. air 1 (SSD-712)', '經典熱門主帳組合', '經典暢銷主帳組', '20210712102540.jpg', 'https://i3.mkgo.net/images/products/20210712102540.jpg', '20210712102707.jpg', 'https://i3.mkgo.net/images/products/20210712102707.jpg', 1, 10, 4, 10, 0, '2021-05-13 01:32:49', '2021-07-12 08:27:06'),
('A', 00002, 'Landbreeze寢室帳 Pro.1 (SD-641)', '家庭露營好選擇', '帳篷本體、本體營柱長（x2）、本體營柱（x1）、前庭營柱（x1）、標準鋁質營釘（17cm x 16）', '20210513033354.jpg', 'https://i3.mkgo.net/images/products/20210513033354.jpg', '20210712102846.jpg', 'https://i3.mkgo.net/images/products/20210712102846.jpg', 1, 2000, 4, 5, 0, '2021-05-13 01:33:52', '2021-07-12 08:28:44'),
('A', 00003, 'Landbreeze寢室帳 Pro.3 (SD-643)', '耐風耐雨的居住空間', '外帳／75D滌塔夫防撕裂布、PU塗層最低耐水壓1,800mm、鐵氟龍撥水加工、抗UV加工；內帳／68', '20210513033524.jpg', 'https://i3.mkgo.net/images/products/20210513033524.jpg', '20210712124154.jpg', 'https://i3.mkgo.net/images/products/20210712124154.jpg', 1, 3000, 3, 10, 0, '2021-05-13 01:35:21', '2021-07-12 10:41:51'),
('A', 00004, 'Landbreeze寢室帳 Pro.4 (SD-644)', '4-6人大帳', '外帳／75D滌塔夫防撕裂布、PU塗層最低耐水壓1,800mm、鐵氟龍撥水加工、抗UV加工；內帳／68', '20210513033555.jpg', 'https://i3.mkgo.net/images/products/20210513033555.jpg', '20210712103760.jpg', 'https://i3.mkgo.net/images/products/20210712103760.jpg', 1, 5000, 4, 5, 0, '2021-05-13 01:35:51', '2021-07-12 08:37:56'),
('A', 00005, 'Amenity Dome 寢室帳 S (SDE-002RH)', '輕便兩人組合', '情侶熱租組，適合兩人', '20210513033657.jpg', 'https://i3.mkgo.net/images/products/20210513033657.jpg', '20210712122255.jpg', 'https://i3.mkgo.net/images/products/20210712122255.jpg', 1, 2500, 4, 10, 0, '2021-05-13 01:36:39', '2021-07-12 10:22:50'),
('A', 00006, 'Amenity Dome 寢室帳 M (SDE-001RH)', '經典大型寢室帳', '防潑水防風', '20210513033740.jpg', 'https://i3.mkgo.net/images/products/20210513033740.jpg', '20210712122449.jpg', 'https://i3.mkgo.net/images/products/20210712122449.jpg', 1, 3000, 4, 5, 0, '2021-05-13 01:37:34', '2021-07-12 10:24:43'),
('A', 00007, 'Amenity Dome 寢室帳 L (SDE-003RH)', '經典大型寢室帳', '經典大型寢室', '20210513033740.jpg', 'https://i3.mkgo.net/images/products/20210513033740.jpg', '20210712122622.jpg', 'https://i3.mkgo.net/images/products/20210712122622.jpg', 10, 5000, 0, 5, 0, '2021-05-13 01:38:11', '2021-07-12 10:26:15'),
('A', 00008, 'Snowpeak拱型帳 (SDE-080H)', '快速搭設，簡易速成', '特殊款', '20210513033848.jpg', 'https://i3.mkgo.net/images/products/20210513033848.jpg', '20210712122708.jpg', 'https://i3.mkgo.net/images/products/20210712122708.jpg', 1, 3500, 4, 5, 0, '2021-05-13 01:38:40', '2021-07-12 10:27:00'),
('A', 00009, 'HD 六角蝶形天幕 Pro. 焚火內掛頂布 (TP-250IR)', '美型天幕，方便使用焚火台', 'HD 六角蝶形天幕 Pro. 焚火內掛頂布，可與TP-250，TP-250R，TP-265和TP-2', '20210513034012.jpg', 'https://i3.mkgo.net/images/products/20210513034012.jpg', '20210712164667.jpg', 'https://i3.mkgo.net/images/products/20210712164667.jpg', 1, 1500, 3, 7, 0, '2021-05-13 01:40:03', '2021-07-12 14:46:58'),
('A', 00010, '焚火方形天幕帳 (TP-430)', '舒適與機能的最佳選擇', '人群聚集在露營場中央，舒適地圍著焚火，這就是露營的魅力 。', '20210513034046.jpg', 'https://i3.mkgo.net/images/products/20210513034046.jpg', '20210712164911.jpg', 'https://i3.mkgo.net/images/products/20210712164911.jpg', 1, 1500, 4, 8, 0, '2021-05-13 01:40:36', '2021-07-12 14:49:01'),
('A', 00011, 'HD 六角蝶形天幕 Pro. (TP-250R)', '大型客廳帳，隨時分享', 'Living Shell 客廳帳 六角蝶形天幕 Pro.', '20210513034116.jpg', 'https://i3.mkgo.net/images/products/20210513034116.jpg', '20210712165013.jpg', 'https://i3.mkgo.net/images/products/20210712165013.jpg', 1, 2000, 0, 5, 0, '2021-05-13 01:41:05', '2021-07-12 14:50:02'),
('A', 00012, '方形天幕 M (TP-841)', '全家大小最方便的選擇', '高度泛用性的長方形，具有多樣的搭營方式', '20210513034140.jpg', 'https://i3.mkgo.net/images/products/20210513034140.jpg', '20210712165054.jpg', 'https://i3.mkgo.net/images/products/20210712165054.jpg', 1, 1200, 3, 2, 0, '2021-05-13 01:41:28', '2021-07-12 14:50:42'),
('A', 00013, '紗網客廳帳 (TP-925)', '新手入門最佳選擇', ' 入門級客廳帳全新改款，讓搭設更簡單！', '20210513034251.jpg', 'https://i3.mkgo.net/images/products/20210513034251.jpg', '20210712165144.jpg', 'https://i3.mkgo.net/images/products/20210712165144.jpg', 1, 2000, 5, 10, 0, '2021-05-13 01:42:38', '2021-07-12 14:51:31'),
('A', 00014, '大地帳 Pro.L (TP-450)', '大空間需求最佳選擇', '多人活動最佳選擇', '20210513034558.jpg', 'https://i3.mkgo.net/images/products/20210513034558.jpg', '20210712165221.jpg', 'https://i3.mkgo.net/images/products/20210712165221.jpg', 1, 4790, 4, 2, 0, '2021-05-13 01:45:44', '2021-07-12 14:52:07'),
('D', 00015, '焚火台M套裝組合', '享受火焰搖曳的魔力 - 焚火台', ' (SET-111) 享受火焰搖曳的魔力 - 焚火台', '20210513034739.jpg', 'https://i3.mkgo.net/images/products/20210513034739.jpg', '20210712170326.jpg', 'https://i3.mkgo.net/images/products/20210712170326.jpg', 1, 600, 4, 5, 0, '2021-05-13 01:47:24', '2021-07-12 16:23:04'),
('D', 00016, '焚火台-M燒烤框架', '須配合焚火台使用', ' (ST-033GBR)不鏽鋼', '20210513034826.jpg', 'https://i3.mkgo.net/images/products/20210513034826.jpg', '20210712170366.jpg', 'https://i3.mkgo.net/images/products/20210712170366.jpg', 1, 200, 0, 5, 0, '2021-05-13 01:48:10', '2021-07-12 16:23:18'),
('E', 00017, ' 酒筒-Titanium', '獨特日本酒外觀，可維持品質', '不鏽鋼酒筒，以日本傳統酒瓶為外觀，除了方便易拿，金屬製的瓶身也提供了高品質的保存條件。', '20210712170871.jpg', 'https://i3.mkgo.net/images/products/20210712170871.jpg', '20210712170626.jpg', 'https://i3.mkgo.net/images/products/20210712170626.jpg', 1, 100, 3, 2, 0, '2021-05-13 01:48:54', '2021-07-12 15:08:54'),
('E', 00018, 'Low chair 吊掛杯架 (UG-282)', '', '不銹鋼、聚酯纖維', '20210513034941.jpg', 'https://i3.mkgo.net/images/products/20210513034941.jpg', '20210712171018.jpg', 'https://i3.mkgo.net/images/products/20210712171018.jpg', 1, 50, 0, 15, 0, '2021-05-13 01:49:23', '2021-07-12 15:10:00'),
('F', 00019, '迷你戶外夜燈＂燈籠花果＂ 森林 ', '', '擁有可愛造型的多功能迷你夜燈', '20210513035020.jpg', 'https://i3.mkgo.net/images/products/20210513035020.jpg', '20210712171065.jpg', 'https://i3.mkgo.net/images/products/20210712171065.jpg', 1, 500, 0, 10, 0, '2021-05-13 01:50:01', '2021-07-12 15:10:46'),
('F', 00020, 'GP自動點火小型瓦斯燈 ', '', '可單手掌握的輕巧主體、輸出80W光亮的微型夜燈', '20210513035057.jpg', 'https://i3.mkgo.net/images/products/20210513035057.jpg', '20210712171232.jpg', 'https://i3.mkgo.net/images/products/20210712171232.jpg', 1, 200, 0, 5, 0, '2021-05-13 01:50:37', '2021-07-12 15:12:12'),
('B', 00021, '快速竹折和室桌S', '竹製輕巧圓桌', '桌板／竹集成材；腳架／耐酸鋁加工；支架／不鏽鋼；收納袋／尼龍', '20210513035141.jpg', 'https://i3.mkgo.net/images/products/20210513035141.jpg', '20210712165346.jpg', 'https://i3.mkgo.net/images/products/20210712165346.jpg', 1, 200, 3, 12, 0, '2021-05-13 01:51:20', '2021-07-12 14:53:25'),
('B', 00022, 'Take! 竹製收合椅', '使用竹製、鐵件及布料的結合', '使用竹製、鐵件及布料的結合的收縮椅，舒適的角度搭配有彈性竹製椅腳及堅固的鐵件，提供你慵懶舒適的體驗。', '20210712170229.jpg', 'https://i3.mkgo.net/images/products/20210712170229.jpg', '20210712170238.jpg', 'https://i3.mkgo.net/images/products/20210712170238.jpg', 1, 200, 3, 10, 0, '2021-05-13 01:51:47', '2021-07-12 15:02:16'),
('B', 00023, '快速竹折桌', '一個動作即可快速收折', '快速竹折桌採用完全創新的收折系統，只要將對折狀態的桌板打開，桌腳就會自動立起，有如立體書般美觀且操作', '20210712171968.jpg', 'https://i3.mkgo.net/images/products/20210712171968.jpg', '20210712171952.jpg', 'https://i3.mkgo.net/images/products/20210712171952.jpg', 6, 300, 4, 10, 0, '2021-07-12 15:19:10', '2021-07-12 15:38:01'),
('B', 00024, '快速竹折桌(加長)', '充滿機能美的竹材摺疊桌', '快速竹折桌採用完全創新的收折系統，只要將對折狀態的桌板打開，桌腳就會自動立起，有如立體書般美觀令人驚', '20210712172260.jpg', '', '20210712172349.jpg', 'https://i3.mkgo.net/images/products/20210712172349.jpg', 1, 400, 4, 10, 0, '2021-07-12 15:22:36', '2021-07-12 15:38:07'),
('B', 00025, '個人快速竹折桌', '一人用竹折桌', '與經典竹製桌相同，快速展開就能享用個人桌面，輕巧方便攜帶。', '20210712172777.jpg', '', '20210712172833.jpg', 'https://i3.mkgo.net/images/products/20210712172833.jpg', 1, 200, 3, 10, 0, '2021-07-12 15:27:52', '2021-07-12 15:38:11'),
('B', 00026, 'My Table 不鏽鋼折桌', '模組化的不鏽鋼折桌', '經典暢銷不鏽鋼折桌，提把設計方便攜帶，同時提供置物空間及掛杯空間，是不可或缺的好幫手。', '20210712173265.jpg', '', '20210712173277.jpg', 'https://i3.mkgo.net/images/products/20210712173277.jpg', 1, 200, 4, 10, 0, '2021-07-12 15:32:39', '2021-07-12 15:38:20'),
('B', 00027, '快速收納架 ', '原木快速收納架', '能快速找到所需的東西，適合室內外使用，原木桌板與金屬掛件，使用折疊式的機械設計，提供方便且易於拿取的', '20210712173759.jpg', '', '20210712173860.jpg', 'https://i3.mkgo.net/images/products/20210712173860.jpg', 1, 500, 4, 10, 0, '2021-07-12 15:37:32', '2021-07-12 15:38:39'),
('B', 00028, '庭園餐桌組(IGT系統)', '木桌及小桌板組合(重型)', '模組化設計的田園餐桌組合，可搭配燒烤設備於中央使用，或是當作長桌使用，同時耐用的木製桌板，可拆卸式的', '20210712174287.jpg', '', '20210712174348.jpg', 'https://i3.mkgo.net/images/products/20210712174348.jpg', 1, 700, 3, 10, 0, '2021-07-12 15:42:59', '2021-07-12 15:43:20'),
('B', 00029, '折疊椅-寬版紅', '加寬尺碼全新登場', '經典款折疊椅，款式相仿，具有帆布製的椅布與椅背。尺寸比以往更寬，坐起來更輕鬆愜意。椅背帶有角度設計，', '20210712174763.jpg', '', '20210712174774.jpg', 'https://i3.mkgo.net/images/products/20210712174774.jpg', 1, 200, 3, 10, 0, '2021-07-12 15:47:34', '2021-07-12 15:50:40'),
('C', 00030, '日式雙人睡墊組', '超越睡袋等級的舒適度', '內含羽絨被、睡墊，兩側與下側有可內翻的反摺處，在翻身時也不容易產生空隙，接近頭部的部分可配合季節或喜', '20210712175352.jpg', '', '20210712175362.jpg', 'https://i3.mkgo.net/images/products/20210712175362.jpg', 1, 500, 4, 10, 0, '2021-07-12 15:53:22', '2021-07-12 15:53:32'),
('C', 00031, '日式單人睡墊組', '舒適的個人睡眠體驗', '	內含羽絨被、睡墊，兩側與下側有可內翻的反摺處，在翻身時也不容易產生空隙，接近頭部的部分可配合季節或喜好往上翻摺，防止冷空氣從肩膀入侵。會與帳篷底部接觸的反摺處(咖啡色的部分)不是用羽絨布，改以化學纖維製成。', '20210712175740.jpg', 'https://i3.mkgo.net/images/products/20210712175740.jpg', '20210712175748.jpg', 'https://i3.mkgo.net/images/products/20210712175748.jpg', 1, 300, 4, 10, 0, '2021-07-12 15:56:51', '2021-07-12 15:58:56'),
('C', 00032, '方形露營睡袋', '以日式被褥為概念的睡袋', '「蓋被」與「鋪被」可分離的系統 藉著拉開兩側的拉鍊，可將「蓋被」和「鋪被」分離。可配合不同的狀況，使用各式各樣的組合。', '20210712180174.jpg', '', '20210712180258.jpg', 'https://i3.mkgo.net/images/products/20210712180258.jpg', 1, 150, 3, 10, 0, '2021-07-12 16:01:42', '2021-07-12 16:02:26'),
('C', 00033, '露營睡袋砂岩色', '熱門方便款', '在頭部的位置設計一個收納袋，塞入衣服後可以變成一個簡易的頭枕。在接近胸口的位置內附小小的口袋。可將手機放進此袋中，在夜晚的帳篷中也能輕鬆找到手機。收納袋壓縮設計，讓睡袋收進收納後，還可以再壓縮，縮小體積。', '20210712180469.jpg', 'https://i3.mkgo.net/images/products/20210712180469.jpg', '20210712180477.jpg', 'https://i3.mkgo.net/images/products/20210712180477.jpg', 1, 100, 4, 10, 0, '2021-07-12 16:04:21', '2021-07-12 16:04:44'),
('C', 00034, '露營充氣睡墊套', '快速舒適，易清潔', '聚酯纖維綿混紡布料，含收納袋的輕便好選擇。', '20210712180765.jpg', '', '20210712180783.jpg', 'https://i3.mkgo.net/images/products/20210712180783.jpg', 1, 150, 3, 10, 0, '2021-07-12 16:07:31', '2021-07-12 16:07:49'),
('D', 00035, '雙口烤肉爐(IGT模組)', '雙口烤肉爐 可安裝在IGT戶外餐廚組上使用', '(CK-160)本產品可使用可拆卸式的迴轉把手調整烤網高度，使難以掌控的炭火變得更容易控制。也可在兩側裝上腳架，享受桌上烤肉的樂趣。', '20210712181084.jpg', '', '20210712181136.jpg', 'https://i3.mkgo.net/images/products/20210712181136.jpg', 1, 250, 5, 10, 0, '2021-07-12 16:10:49', '2021-07-12 16:11:01'),
('D', 00036, '攜帶型烤爐(木柴用)', '可製作披薩或是炭烤', '通過使用木柴和使用木炭的烤箱烹飪，您可以製作出如同使用家用微波爐或木炭的 500°C 高溫的比薩。', '20210712181450.jpg', 'https://i3.mkgo.net/images/products/20210712181450.jpg', '20210712181459.jpg', 'https://i3.mkgo.net/images/products/20210712181459.jpg', 1, 400, 4, 10, 0, '2021-07-12 16:13:50', '2021-07-12 16:14:23'),
('D', 00037, '1/2深煎盤(模組)', '鋼板處理可煎物的模組煎盤', '2.0mm鋼板、經表面處理之黑皮鐵板製成，深度可輕易料理煎煮等等食材，需與模組搭配使用。', '20210712181672.jpg', '', '20210712181741.jpg', 'https://i3.mkgo.net/images/products/20210712181741.jpg', 1, 100, 3, 10, 0, '2021-07-12 16:16:35', '2021-07-12 16:17:04'),
('D', 00038, '烤爐桶炭盆', '需與烤爐搭配使用', '需與烤爐搭配使用', '20210712181896.jpg', '', '20210712181948.jpg', 'https://i3.mkgo.net/images/products/20210712181948.jpg', 1, 100, 2, 10, 0, '2021-07-12 16:18:58', '2021-07-12 16:19:10'),
('D', 00039, '烤爐桶', '需搭配炭盆使用', '(ST-091)多功能的烤爐桶，提供燒烤和烤箱的功能，享受各種佳餚。', '20210712182069.jpg', '', '20210712182171.jpg', 'https://i3.mkgo.net/images/products/20210712182171.jpg', 1, 500, 5, 10, 0, '2021-07-12 16:20:30', '2021-07-12 16:21:32'),
('D', 00040, '焚火台L套裝組合', '享受火焰搖曳的魔力 ', '(SET-112S)採用堅固的不鏽鋼素材製成。外型為倒四角錐狀。只需打開放在地上就能輕鬆完成設置。本產品亦可依尺寸選購專用的燒烤框架。可使用烤網或鐵板享受碳烤料理的樂趣。', '20210712182566.jpg', '', '20210712182593.jpg', 'https://i3.mkgo.net/images/products/20210712182593.jpg', 1, 300, 4, 10, 0, '2021-07-12 16:25:26', '2021-07-12 16:25:53'),
('E', 00041, '料理器具組', '附收納袋', '套裝組內容尼龍杓、尼龍鏟、鍋鏟、收納袋', '20210712182787.jpg', '', '20210712182841.jpg', 'https://i3.mkgo.net/images/products/20210712182841.jpg', 1, 50, 4, 10, 0, '2021-07-12 16:27:46', '2021-07-12 16:28:00'),
('D', 00042, 'Home & Camp 鍋具組', '新型態鍋具組戶外烹飪更輕鬆', '在家做好前置作業，便可將整鍋食材直接帶著走。  新型態鍋具組，讓您在戶外烹飪更輕鬆。', '20210712182968.jpg', '', '20210712182979.jpg', 'https://i3.mkgo.net/images/products/20210712182979.jpg', 1, 100, 4, 10, 0, '2021-07-12 16:29:26', '2021-07-12 16:29:37'),
('E', 00043, '土鍋膳', '豐富單身貴族或兩人生活的餐點', '不管是熱愛野遊的人還是不從事戶外活動的人，我們都希望讓各位的生活更加豐富，並且享受豐盛的餐點。土鍋具備高保溫性與遠紅外線效果，可以烹煮出美味Q彈的白飯。 因此我們打造了土鍋膳。', '20210712183147.jpg', '', '20210712183159.jpg', 'https://i3.mkgo.net/images/products/20210712183159.jpg', 1, 100, 4, 10, 0, '2021-07-12 16:31:04', '2021-07-12 16:31:16'),
('E', 00044, '日本鑄鐵鍋26\"', '極薄鑄鐵製荷蘭鍋', 'Snow Peak極薄鑄鐵製荷蘭鍋，源自於Snow Peak的家園—新潟縣燕三条地區，受惠於這裏優異的鑄造技術，我們以前所未有的概念研發出極薄鑄鐵荷蘭鍋系列產品。在鑄鐵器具的生產過程中，為了讓鑄件成型，必須使用砂模，然後將滾燙的鐵水注入砂模中。Snow Peak採用的鑄造成型技術，則是在製作砂模時加入人造樹脂，使砂模的表面更為光滑細緻，因此完成的鑄件表面格外優美而細膩，與過去的鑄鐵質感截然不同，不但材質堅韌富有彈性，而且比以前更薄更輕巧。厚度變薄、重量變輕，使用起來自然更輕鬆，對於冷熱衝擊（高溫狀態下急速', '20210712183363.jpg', '', '20210712183388.jpg', 'https://i3.mkgo.net/images/products/20210712183388.jpg', 1, 100, 4, 10, 0, '2021-07-12 16:33:19', '2021-07-12 16:33:44'),
('E', 00045, '圓型迷你鑄鐵鍋', '個人用迷你型球墨鑄鐵', '個人用迷你型球墨鑄鐵（耐熱矽膠塗裝)', '20210712190093.jpg', '', '20210712190103.jpg', 'https://i3.mkgo.net/images/products/20210712190103.jpg', 43, 50, 4, 10, 0, '2021-07-12 17:00:48', '2021-07-12 17:00:59'),
('E', 00046, '不鏽鋼煙燻盒', '不鏽鋼煙燻盒', '小巧型不鏽鋼煙燻盒，方便隨時製作煙燻料理，簡單易用。不鏽鋼材質，耐高溫可重複使用。 (CS-092) ', '20210712190547.jpg', '', '20210712190574.jpg', 'https://i3.mkgo.net/images/products/20210712190574.jpg', 22, 150, 4, 10, 0, '2021-07-12 17:05:01', '2021-07-12 17:05:28'),
('G', 00047, '耐熱三指手套', '耐熱手套', '(UG-024)牛皮、棉花、聚酯纖維', '20210712190781.jpg', '', '20210712190796.jpg', 'https://i3.mkgo.net/images/products/20210712190796.jpg', 22, 50, 4, 10, 0, '2021-07-12 17:07:34', '2021-07-12 17:07:49'),
('E', 00048, '折疊式三明治烤盤', '可製作火烤三明治', '不但可製作火烤三明治，還能享受創作甜點樂趣', '20210712190978.jpg', '', '20210712191000.jpg', 'https://i3.mkgo.net/images/products/20210712191000.jpg', 24, 50, 5, 20, 0, '2021-07-12 17:09:30', '2021-07-12 17:09:52'),
('E', 00049, '不鏽鋼露營咖啡壺', '沖煮香醇的咖啡', '不鏽鋼材質，煮出香濃的咖啡', '20210712193174.jpg', '', '20210712193661.jpg', 'https://i3.mkgo.net/images/products/20210712193661.jpg', 1, 50, 3, 10, 0, '2021-07-12 17:31:25', '2021-07-12 17:36:12'),
('E', 00050, 'MiniSolo 鈦金屬個人鍋', '鈦金屬個人鍋', '鈦金屬個人鍋', '20210712193462.jpg', '', '20210712193677.jpg', 'https://i3.mkgo.net/images/products/20210712193677.jpg', 23, 30, 4, 10, 0, '2021-07-12 17:34:12', '2021-07-12 17:36:27'),
('E', 00051, '不鏽鋼餐盤組-4人四件組', '不鏽鋼餐盤組', '不鏽鋼餐盤組', '20210712194155.jpg', '', '20210712194171.jpg', 'https://i3.mkgo.net/images/products/20210712194171.jpg', 28, 50, 3, 20, 0, '2021-07-12 17:41:04', '2021-07-12 17:41:20'),
('D', 00052, '焚火台 SR', '能夠緊湊折疊收納的小型焚火台', '橋的部份能放置1/2烤肉網(S-029HA)或是1/2深煎盤 (S-029HD)。 產品內付底板，防止焚火的熱和灰燼對場地造成損壞。', '20210712194385.jpg', '', '20210712194457.jpg', 'https://i3.mkgo.net/images/products/20210712194457.jpg', 12, 100, 4, 10, 0, '2021-07-12 17:43:33', '2021-07-12 17:44:05'),
('E', 00053, '派對盤組', '適合派對使用的餐盤', '適合派對使用的餐盤，附瀝水網可食用涼麵及食用沙拉', '20210712195302.jpg', '', '20210712195357.jpg', 'https://i3.mkgo.net/images/products/20210712195357.jpg', 45, 50, 4, 10, 0, '2021-07-12 17:52:49', '2021-07-12 17:53:04'),
('G', 00054, '強力達人鋼鎚II ', '木柄握把手感厚實，易掌握好操作', '高強度鐵鎚，擁有優異的擺動平衡 一體成形，鐵鎚頭重量適中 木柄握把手感厚實，易掌握好操作 頭部可拔釘設計，拔營好幫手', '20210712195673.jpeg', '', '20210712195771.jpg', 'https://i3.mkgo.net/images/products/20210712195771.jpg', 48, 100, 3, 20, 0, '2021-07-12 17:56:19', '2021-07-12 17:57:17'),
('F', 00055, '氣化燈', '翻蓋式限量原創收納燈盒', '經典重現氣化燈200B設計 翻蓋式限量原創收納燈盒', '20210712200088.jpg', '', '20210712200105.jpg', 'https://i3.mkgo.net/images/products/20210712200105.jpg', 48, 100, 4, 10, 0, '2021-07-12 18:00:33', '2021-07-12 18:00:50'),
('F', 00056, '290氣化大雙燈 ', ' 300燭光的絕佳明亮度', 'CM-0290JM000雙燈蕊氣化燈的超人氣商品 300燭光的絕佳明亮度', '20210712200410.jpg', 'https://i3.mkgo.net/images/products/20210712200410.jpg', '20210712200469.jpg', 'https://i3.mkgo.net/images/products/20210712200469.jpg', 54, 100, 4, 20, 0, '2021-07-12 18:03:30', '2021-07-12 18:04:13'),
('F', 00057, ' LED營燈200 綠橄欖', '尺寸小巧，最適合野外活動時使用', '防止電源關閉後過度放電並延長電池壽命 尺寸小巧，最適合野外活動時使用 暖光系色溫 防水性能：符合IPX4（可阻擋全方向液體噴灑）', '20210712201066.jpg', 'https://i3.mkgo.net/images/products/20210712201066.jpg', '20210712201559.jpg', 'https://i3.mkgo.net/images/products/20210712201559.jpg', 46, 50, 4, 10, 0, '2021-07-12 18:09:56', '2021-07-12 18:15:02');

-- --------------------------------------------------------

--
-- 資料表結構 `ptagmap`
--

CREATE TABLE `ptagmap` (
  `tmId` int(11) NOT NULL COMMENT '標籤索引編號',
  `tagId` int(11) NOT NULL COMMENT '標籤編號',
  `pId` int(5) UNSIGNED ZEROFILL NOT NULL COMMENT '物品編號',
  `obj` int(11) NOT NULL COMMENT '類別',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `ptagmap`
--

INSERT INTO `ptagmap` (`tmId`, `tagId`, `pId`, `obj`, `created_at`, `updated_at`) VALUES
(500, 1, 00001, 2, '2021-05-10 22:33:27', '2021-07-11 13:03:47'),
(501, 2, 00002, 2, '2021-05-10 22:34:11', '2021-07-14 02:27:13'),
(502, 1, 00003, 2, '2021-05-10 22:34:11', '2021-07-11 11:30:21'),
(503, 3, 00004, 2, '2021-05-11 23:42:22', '2021-07-14 02:27:16'),
(504, 1, 00005, 2, '2021-05-11 23:42:22', '2021-07-11 11:30:21'),
(505, 1, 00006, 2, '2021-05-11 23:42:51', '2021-07-11 11:30:21'),
(506, 10, 00007, 2, '2021-05-11 23:42:51', '2021-07-11 18:18:57'),
(507, 1, 00008, 2, '2021-05-11 23:43:22', '2021-07-11 11:30:21'),
(508, 6, 00009, 2, '2021-05-11 23:43:22', '2021-07-13 16:16:03'),
(509, 6, 00010, 2, '2021-05-11 23:43:51', '2021-07-13 16:16:04'),
(510, 1, 00011, 2, '2021-05-10 22:19:45', '2021-07-11 11:30:21'),
(511, 1, 00012, 2, '2021-05-10 22:19:45', '2021-07-11 11:30:21'),
(512, 4, 00013, 2, '2021-05-10 22:20:17', '2021-07-14 02:27:19'),
(513, 1, 00014, 2, '2021-05-10 22:20:17', '2021-07-11 11:30:21'),
(514, 1, 00015, 2, '2021-05-10 22:20:56', '2021-07-11 11:30:21'),
(515, 1, 00016, 2, '2021-05-10 22:20:56', '2021-07-11 11:30:21'),
(516, 1, 00017, 2, '2021-05-10 22:21:15', '2021-07-11 11:30:21'),
(517, 5, 00018, 2, '2021-05-10 22:25:17', '2021-07-14 02:27:22'),
(518, 1, 00019, 2, '2021-05-10 22:31:23', '2021-07-11 11:30:21'),
(519, 1, 00020, 2, '2021-05-10 22:31:23', '2021-07-11 11:30:21'),
(520, 1, 00021, 2, '2021-05-10 22:31:56', '2021-07-11 11:30:21'),
(521, 1, 00022, 2, '2021-05-10 22:31:56', '2021-07-11 11:30:21'),
(522, 1, 00023, 2, '2021-05-10 22:32:23', '2021-07-11 11:30:21'),
(523, 1, 00024, 2, '2021-05-11 23:43:51', '2021-07-11 11:30:21'),
(524, 1, 00025, 2, '2021-07-11 01:36:35', '2021-07-11 11:26:57'),
(5057, 6, 00023, 2, '2021-07-12 23:19:10', '2021-07-12 23:19:10'),
(5058, 1, 00024, 2, '2021-07-12 23:22:36', '2021-07-12 23:22:36'),
(5059, 1, 00025, 2, '2021-07-12 23:27:52', '2021-07-12 23:27:52'),
(5060, 1, 00026, 2, '2021-07-12 23:32:39', '2021-07-12 23:32:39'),
(5061, 1, 00027, 2, '2021-07-12 23:37:32', '2021-07-12 23:37:32'),
(5062, 1, 00028, 2, '2021-07-12 23:42:59', '2021-07-12 23:42:59'),
(5063, 1, 00029, 2, '2021-07-12 23:47:34', '2021-07-12 23:47:34'),
(5064, 1, 00030, 2, '2021-07-12 23:53:22', '2021-07-12 23:53:22'),
(5065, 1, 00031, 2, '2021-07-12 23:56:51', '2021-07-12 23:56:51'),
(5066, 1, 00032, 2, '2021-07-13 00:01:42', '2021-07-13 00:01:42'),
(5067, 1, 00033, 2, '2021-07-13 00:04:21', '2021-07-13 00:04:21'),
(5068, 1, 00034, 2, '2021-07-13 00:07:31', '2021-07-13 00:07:31'),
(5069, 1, 00035, 2, '2021-07-13 00:10:49', '2021-07-13 00:10:49'),
(5070, 1, 00036, 2, '2021-07-13 00:13:50', '2021-07-13 00:13:50'),
(5071, 1, 00037, 2, '2021-07-13 00:16:35', '2021-07-13 00:16:35'),
(5072, 1, 00038, 2, '2021-07-13 00:18:58', '2021-07-13 00:18:58'),
(5073, 1, 00039, 2, '2021-07-13 00:20:30', '2021-07-13 00:20:30'),
(5074, 1, 00040, 2, '2021-07-13 00:25:26', '2021-07-13 00:25:26'),
(5075, 1, 00041, 2, '2021-07-13 00:27:46', '2021-07-13 00:27:46'),
(5076, 1, 00042, 2, '2021-07-13 00:29:26', '2021-07-13 00:29:26'),
(5077, 1, 00043, 2, '2021-07-13 00:31:04', '2021-07-13 00:31:04'),
(5078, 1, 00044, 2, '2021-07-13 00:33:19', '2021-07-13 00:33:19'),
(5079, 43, 00045, 2, '2021-07-13 01:00:48', '2021-07-13 01:00:48'),
(5080, 22, 00046, 2, '2021-07-13 01:05:01', '2021-07-13 01:05:01'),
(5081, 22, 00047, 2, '2021-07-13 01:07:34', '2021-07-13 01:07:34'),
(5082, 24, 00048, 2, '2021-07-13 01:09:30', '2021-07-13 01:09:30'),
(5083, 1, 00049, 2, '2021-07-13 01:31:25', '2021-07-13 01:31:25'),
(5084, 23, 00050, 2, '2021-07-13 01:34:12', '2021-07-13 01:34:12'),
(5085, 28, 00051, 2, '2021-07-13 01:41:04', '2021-07-13 01:41:04'),
(5086, 12, 00052, 2, '2021-07-13 01:43:33', '2021-07-13 01:43:33'),
(5087, 45, 00053, 2, '2021-07-13 01:52:49', '2021-07-13 01:52:49'),
(5088, 48, 00054, 2, '2021-07-13 01:56:19', '2021-07-13 01:56:19'),
(5089, 48, 00055, 2, '2021-07-13 02:00:33', '2021-07-13 02:00:33'),
(5090, 54, 00056, 2, '2021-07-13 02:03:30', '2021-07-13 02:03:30'),
(5091, 46, 00057, 2, '2021-07-13 02:09:56', '2021-07-13 02:09:56');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `productcategory`
--
ALTER TABLE `productcategory`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `cat_id` (`cat_id`);

--
-- 資料表索引 `productlist`
--
ALTER TABLE `productlist`
  ADD PRIMARY KEY (`product_id`);

--
-- 資料表索引 `ptagmap`
--
ALTER TABLE `ptagmap`
  ADD PRIMARY KEY (`tmId`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `productcategory`
--
ALTER TABLE `productcategory`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `productlist`
--
ALTER TABLE `productlist`
  MODIFY `product_id` int(5) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT COMMENT '商品編號', AUTO_INCREMENT=58;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `ptagmap`
--
ALTER TABLE `ptagmap`
  MODIFY `tmId` int(11) NOT NULL AUTO_INCREMENT COMMENT '標籤索引編號', AUTO_INCREMENT=5092;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
